Same here :(
It happens to me with ad_computer resource:

```terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated
with the following symbols:
  + create

Terraform will perform the following actions:

  # ad_computer.test will be created
  + resource "ad_computer" "test" {
      + container = "OU=foo,OU=,DC=bar,DC=com"
      + dn        = (known after apply)
      + guid      = (known after apply)
      + id        = (known after apply)
      + name      = "test"
      + pre2kname = (known after apply)
      + sid       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - data     = "CN=test,OU=foo,OU=,DC=bar,DC=com" -> null
  + resource = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ad_computer.test: Creating...
╷
│ Error: Provider produced inconsistent result after apply
│ 
│ When applying changes to ad_computer.test, provider "provider[\"registry.terraform.io/hashicorp/ad\"]" produced
│ an unexpected new value: Root resource was present, but now absent.
│ 
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
``` 